#include <stdio.h>

int main(int argc, char **argv) {
    // Q: 正序分解正整数
    // 例如： 输入12345
    //        输出1 2 3 4 5
    
    // 分析：辗转相除法
    // 假设t=10000
    // 假设x=70080
    // 70080 / 10000 = 7
    // 70080 % 10000 = 0080
    // 10000 / 10 = 1000
    // 0080 / 1000 = 0
    // 0080 % 1000 = 080
    // 1000 / 10 = 100
    // 080 / 100 = 0
    // 080 % 100 = 80
    // 100 / 10 = 10
    // 80 / 10 = 8
    // 80 % 10 = 0
    // 10 / 10 = 1
    // 0 / 1 = 0
    // 0 % 1 = 0
    // 1 / 10 = 0
    
    // 存放用户输入的数字
    int x;
    // 记录位数
    int t = 1;
    
    printf("请输入任意正整数\n");
    scanf("%d", &x);
    int val = x;
    
    while(val > 9) {
        val /= 10;
        t *= 10;
        printf("val=%d, t=%d, x=%d\n", val, t, x);
    }
    
    do {
        int d = x / t;
        printf("%d", d);
        if (t>0) {
            printf(" ");
        }
        x %= t;
        t /= 10;
    } while (t>0);
    
    return 0;
}
